const cmfu = {
    "1035341423" : "我不可能会录这种自述",
    "1035313493" : "从解析太阳开始",
    "1034869678" : "我只想搞钱",
    "1035362595" : "异化武道",
    "1035166655" : "这个演员刑啊",
    "1016150754" : "亏成首富从游戏开始",
    "1035304619" : "长生仙缘：从照顾道兄妻女开始",
    "1035282882" : "神明模拟器",
    "1032685713" : "诡术轮回",
    "1077731" : "人道天堂",
    "1245641" : "天道计划",
    "1030051580" : "我的器官是妖怪",
    "1026633948" : "矩阵天王",
    "1031790503" : "我，天煞孤星，爱好交友",
    "1031835147" : "我写的自传不可能是悲剧",
    "1025990049" : "术师手册",
    "1034754526" : "迷雾之仙",
    "1028214828" : "解构诡异",
    "1033893441" : "国民法医",
    "1023715291" : "旧日之箓",
    "1031159866" : "魔门大玩家",
    "1033516786" : "从机械猎人开始",
    "1033786783" : "我在黄泉当教主"
};

let 文本 = "";

for (const 键 of Object.keys(cmfu).sort((a , b) => Number(a) - Number(b))) {
    文本 += `<li><a href = "https://m.qidian.com/book/${键}.html">${cmfu[键]}</a></li>`
}
文本 = `<ul>${文本}</ul>`;

document.getElementById("cmfu_book").innerHTML = 文本;
